app/views/reviews/new.html.erb

<%= form_for @review do |f| %>
<%= f.collection_select :game_id, Game.all, :id, :title %>
---
SELECT "games".* FROM "games"